/**
 * Created by sabir on 03.10.15.
 */

var DataFactory = {
    TGUexercisesTabs: [
        {
            name: 'Вам выпал вариант №1',
            classId: 'pVnzP0b8Zi',
            exercises: [{
                id: 'DOyezBffE7' //1
            },{
                id: 'FQp4lZjNnl' //4
            },{
                id: 'oEHA5TUmFd' //2
            },{
                id: 'jO7io0Kto0' //6
            },{
                id: 'U7gbosWtYj' //3
            },{
                id: 'EbUUvfpUDp' //5
            }]
        },{
            name: 'Вам выпал вариант №2',
            classId: 'fsesztu3sv',
            exercises: [{
                id: 'U1q2dNgOug' //1
            },{
                id: '5oBYCo7gEl' //4
            },{
                id: 'I4tijMOkJY' //2
            },{
                id: '7pkSJkO8P7' //6
            },{
                id: 'Ui68jI7R1i' //3
            },{
                id: 'JehpqoQVaH' //5
            }]
        },{
            name: 'Вам выпал вариант №3',
            classId: 'OmtXwYTkdS',
            exercises: [{
                id: 'J81bqbA0tB' //1
            },{
                id: 'zk3sa4MWPh' //4
            },{
                id: 'p6JxV5khgm' //2
            },{
                id: '9di3ZrVMMy' //6
            },{
                id: 'yPqvp3gtpG' //3
            },{
                id: 'KTv45AqXP4' //5
            }]
        },{
            name: 'Вам выпал вариант №4',
            classId: '0oVdSxatpt',
            exercises: [{
                id: 'Qwk69jOK3H' //1
            },{
                id: 'TVnxuhUlnD' //4
            },{
                id: 'Fr6FTFivY0'  //2
            },{
                id: 'A3ABlUKZyq' //6
            },{
                id: 'rLRBp3lNg2'  //3
            },{
                id: 'EbUUvfpUDp' //5
            }]
        },{
            name: 'Вам выпал вариант №5',
            classId: 'Ldj5tYZvZa',
            exercises: [{
                id: 'IkYr6PcCy2' //1
            },{
                id: '0LKesnpQMP' //4
            },{
                id: 'T5dyY2zNo4' //2
            },{
                id: 'Pn8zOJL1UJ' //6
            },{
                id: '3XE7JJR74r' //3
            },{
                id: 'JehpqoQVaH' //5
            }]
        }
    ],


    SAUSAGE_ITEMS: [{
        name: 'Аудирование',
        avatar: 'https://englishpatient.org/app/assets/img/avatars/_1.jpg',
        description: 'Труднее всего - научить понимать реальную речь. Для решения этой задачи мы создали тренажеры и собрали видеоматериалы.',
        id: 1,
        items: [
            {
                name: 'Запись текстов коротких сюжетов на слух',
                description: '',
                content: 'Обратите внимание на 2-й образец: если видео слишком длинное, мы разбиваем его на части, которые повторяются для Вашего удобства.',
                vimeoId: '137363222',
                exercises: []
            },
            {
                name: 'Просмотр видео с внешними укрупненными субтитрами',
                description: '',
                content: 'Смотрите фильмы и другие видеосюжеты, которые мы снабдили крупными, удобными для ведения занятий и самостоятельной работы учеников субтитрами.',
                vimeoId: '137363395',
                exercises: []
            },
            {
                name: 'Изучение сложных звуков с помощью аутентичных материалов',
                description: '',
                content: 'Мы подготовили для Вас тренажеры для отработки самых сложных звуков и буквосочетаний.',
                vimeoId: '137363394',
                exercises: []
            },
            {
                name: 'Заполнение пробелов в текстах сюжетов',
                description: '',
                content: 'Тренируйте аудирование, используя наш тренажер на заполнение пропусков в коротких видеосюжетах.',
                vimeoId: '137363398',
                exercises: []
            }

        ]
    }, {
        name: 'Говорение',
        avatar: 'https://englishpatient.org/app/assets/img/avatars/_2.jpg',
        id: 2,
        description: 'Мы уделяем максимальное внимание вашей способности говорить на иностранном языке. Для работы Вам понадобится микрофон (встроенный в Ваш ноутбук либо внешний) - мы будем записывать Ваш голос.',
        items: [
            {
                name: 'Перевод коротких фраз из текстов, аудио или видео за ограниченное время',
                description: '',
                content: '',
                vimeoId: '137363400',
                exercises: []
            },
            {
                name: 'Описание увиденного или услышанного',
                description: '',
                content: '',
                vimeoId: '137363397',
                exercises: []
            },
            {
                name: 'Выражение собственных мыслей, переведенных носителями языка',
                description: '',
                content: 'Наши сотрудники из Америки, Великобритании и Австралии переведут и озвучат Ваши мысли, которые Вам будет легко повторить и выучить.',
                vimeoId: '137363396',
                exercises: []
            },
            {
                name: 'Отработка местоимений (он, она, мы…) в условиях, приближенных к реальным',
                description: '',
                vimeoId: '137363402',
                content: 'Тренажер позволяет новичкам овладеть местоимениями иностранного языка, а опытные ученики могут ускорить реакцию своей речи.',
                exercises: []
            },
            {
                name: 'Формирование образов без использования слов родного языка',
                vimeoId: '137363403',
                content: 'Мы не готовим переводчиков - мы учим говорить и думать на иностранном языке. Данный тренажер - яркий тому пример.',
                description: ''
            },
            {
                name: 'Отработка применения и понимания определенных слов и фраз',
                vimeoId: '137366375',
                content: 'Некоторые расхожие слова и фразы представляют трудность - будь то в письменном или устном виде. Таким фразам и словам мы посвящаем отдельные тренажеры.',
                description: '',
                exercises: []
            },
            {
                name: 'Работа с готовыми конструкциями путем подстановки требуемых слов или фраз',
                description: '',
                vimeoId: '137363405',
                content: 'Некоторые вещи проще запомнить наизусть, чем учить правила, из которых слишком много исключений. Таким образом, Вы способны пополнить свой словарный запас высказыванием любой сложности.',
                exercises: []
            },
            {
                name: 'Отработка сложных звуков и сочетаний звуков',
                vimeoId: '137363408',
                content: '',
                description: '',
                exercises: []
            },
            {
                name: 'Разбор и наговор сюжета, разделенного на короткие видео',
                vimeoId: '137363410',
                content: '',
                description: '',
                exercises: []
            },
            {
                name: 'Прослушивание и запись Вашей версии иностранных песен',
                vimeoId: '137363409',
                content: 'Меломану намного проще изучать иностранный язык. Петь или говорить - выбирайте сами.',
                description: '',
                exercises: []
            },
            {
                name: 'Работа с коллекциями сюжетов определенной сложности',
                description: '',
                content: 'Материал, который мы предлагаем, различается по сложности - интересное найдется как для начинающего, так и для продвинутого ученика.',
                vimeoId: '137363411',
                exercises: []
            },
            {
                name: 'Работа с реальными диалогами в роли одного из персонажей',
                description: '',
                vimeoId: '137363413',
                content: '',
                exercises: []
            }



        ]
    }, {
        name: 'Чтение',
        avatar: 'https://englishpatient.org/app/assets/img/avatars/_3.jpg',
        id: 3,
        description: undefined,
        items: [
            {
                name: 'Чтение текстов, рекомендуемых к прочтению на Вашем уровне владения языком',
                description: '',
                content: '',
                vimeoId: undefined,
                exercises: []
            },
            {
                name: 'Работа с текстами, снабженными аудио',
                description: '',
                content: '',
                vimeoId: undefined,
                exercises: []
            },
            {
                name: 'Английский блог директора школы "Английский Пациент" Ю. Лирмака',
                description: '',
                content: '',
                vimeoId: '137363412',
                exercises: []
            }

        ]
    }, {
        name: 'Письмо',
        avatar: 'https://englishpatient.org/app/assets/img/avatars/_4.jpg',
        id: 4,
        description: undefined,
        items: [
            {
                name: 'Набор текста на иностранном языке',
                description: '',
                content: '',
                vimeoId: undefined,
                exercises: []
            },
            {
                name: 'Выработка навыка записи на слух',
                description: '',
                content: '',
                vimeoId: undefined,
                exercises: []
            }

        ]
    }, {
        name: 'Грамматика',
        avatar: 'https://englishpatient.org/app/assets/img/avatars/_5.jpg',
        id: 5,
        description: 'Облегченное изучение необходимой грамматики на ярких примерах из реальной жизни',
        items: [

        ]
    }, {
        name: 'Лексика',
        avatar: 'https://englishpatient.org/app/assets/img/avatars/_6.jpg',
        id: 6,
        description: 'Помимо изучения новых фраз, мы уделяем особое внимание их закреплению. Пользуйтесь нашими инструментами, и то, что было однажды услышано, закрепится в Вашей памяти на всю жизнь.',
        items: [
            {
                name: 'Изучение и запоминание идиом и других необычных конструкций: IDIOPHRASES.com',
                description: '',
                content: ' Идиомы и устойчивые сочетания не "изюм в кексе" - это сам кекс.',
                vimeoId: '137363415',
                exercises: []
            },
            {
                name: 'Поиск видеосюжетов, в которых звучат нужные Вам слова или фразы',
                description: '',
                content: '',
                vimeoId: '137363417',
                exercises: []
            },
            {
                name: 'Создание собственной библиотеки материалов',
                vimeoId: '137365764',
                exercises: []
            },
            {
                name: 'Быстрое освоение основ языка с минимальными усилиями со стороны ученика путем просмотра специально изготовленных коротких видеоматериалов',
                description: '',
                vimeoId: '137363416',
                content: 'Наработайте начальную базу фраз иностранного языка, которые позволят Вам "набрать ход" при любом уровне изначальной подготовки.',
                exercises: []
            }

        ]
    }],

    NEW_SAUSAGE_MAP: {
        'listening': {
            name: 'Аудирование',
            description: 'В основе нашей платформы – осознание приоритета звуков и ' +
            'образов над символами на бумаге или мониторе, когда речь идет об изучении языка. ' +
            'Так изучают язык дети: они сначала слушают и смотрят, потом говорят, потом – все остальное. ' +
            '<br/>' +
            '<br/>' +
            'Тренажеры по аудированию – <b>попытка сжать время</b>, дав взрослым возможность научиться ' +
            'воспринимать английский язык так, как это делают дети. ' +
            'Кстати, у взрослых преимущество – <b>они уже умеют читать</b>.' +
            '<br/>' +
            '<br/>' +
            'Именно поэтому мы решили поместить на главную страницу высказывание ' +
            'Честертона о том, что язык древнее науки. О том, что его изобрели не ученые…' +
            '' +
            '<br/>' +
            '<br/>' +
            '<h3 style="text-align: center;" >Посмотрите примеры тренажеров</h3>' +
            '<br/><br/>',
            vimeoId: '151307758',
            feedId: 'zPgURLrgUc',
            backgroundImg: 'https://www.englishpatient.org/app/assets/images/front/aud.jpg'
        },

        'speaking': {
            name: 'Говорение',
            description: 'Преподаватели знают, сколько энергии нужно приложить, ' +
            'чтобы все их ученики одновременно занимались говорением – особенно в ' +
            'тех случаях, когда уровень владения языком еще не позволяет участвовать в дискуссии. ' +
            '<br/></br>' +
            'Для решения этой задачи мы разместили на нашей платформе разнообразные тренажеры. ' +
            'Все они используют исключительно аутентичные материалы для инициации речи ученика. ' +
            'Во всех случаях предусмотрена запись речи для дальнейшей проверки заданий преподавателем. ' +
            '<br/><br/>' +
            'Тренажеры делятся на пассивные и активные в зависимости от того, ' +
            'требуется ли при говорении принимать решения и импровизировать или просто повторять услышанный материал. ' +
            'Почти во всех случаях мы исключили фазу трансляции с родного языка – в ' +
            'основе активных тренажеров только фразы на английском языке (есть только один ' +
            'тренажер, в котором нужно переводить короткие фразы с русского языка на английский).' +
            '<br/><br/>',
            vimeoId: '151373444',
            feedId: '2cDxb9TM9m',
            backgroundImg: 'https://www.englishpatient.org/app/assets/images/front/spe.jpg'
        },

        'grammar': {
            name: 'Грамматика',
            description: 'Лучший способ изучить грамматику любого языка – ' +
            'родиться и жить в стране, где на этом языке говорят. ' +
            'Поэтому мы предлагаем усилить изучение грамматики примерами из аутентичных источников. ' +
            'Комментарии к сюжетам позволят глубже понять изучаемую грамматическую конструкцию, ' +
            'а предлагаемые тренажеры – закрепить правила на практике.',
            vimeoId: '151421516',
            feedId: 'YtutP6HJN9',
            backgroundImg: 'https://www.englishpatient.org/app/assets/images/front/gra.jpg'
        },

        'lecsics': {
            name: 'Лексика',
            description: 'В результате многолетней работы над аутентичными видео материалами накоплена ' +
            'гигантская коллекция коротких сюжетов, которая претендует на то, что она способна покрыть весь ' +
            'английский язык. ' +
            'Даже, если это и не совсем так, то вы убедитесь, что наша платформа может ' +
            'проиллюстрировать тысячи слов, сотни идиом, десятки пословиц.' +
            '' +
            '<br/></br>' +
            'Все разрозненные единицы в руках умелого преподавателя и методиста ' +
            'превращаются в уникальные тренажеры, которые потом объединяются в курсы. ' +
            'Надеемся, что вам понравятся наши наработки. Уверены, что на основе нашей платформы вы ' +
            'сможете изготовить много разнообразных упражнений на свой вкус. ' +
            'Библиотека коротких видео фрагментов постоянно пополняется.' +
            '' +
            '<br/><br/>',
            vimeoId: '151483912',
            feedId: '6BJfWTe1c4',
            backgroundImg: 'https://www.englishpatient.org/app/assets/images/front/lec.jpg'
        },

        'classes': {
            name: 'Управление обучением',
            description: 'Ценность нашей платформы не только в уникальном ' +
            'количестве видео фрагментов -«атомов», из которых состоит реальный язык, ' +
            'но и в том, что мы разработали структуру усвоения этой информации учениками. ' +
            'При этом мы вооружили преподавателя инструментарием разделения учеников на классы, ' +
            'слежения за эволюцией их успехов и обратной связью. ' +
            '<br/><br/>' +
            'Наша платформа поможет вам управлять обучением, как малой группы под ' +
            'руководством репетитора, так и нескольких факультетов или филиалов крупной корпорации. ' +
            'С нашей помощью вы не только добьетесь успехов, но и оптимизируете процесс образования. ' +
            '<br/></br/>' +
            '' +
            'Выбор за вами!',
            vimeoId: '151551106',
            feedId: undefined,
            backgroundImg: 'https://www.englishpatient.org/app/assets/images/front/cla.jpg'
        }

    },

    PRICING_MAP: {
        'free': {
            name: 'Репетитор',
            price: 0,
            options: [
                {
                    text: 'до <b>5</b> учеников'
                }
            ],
            description: '' +
            '<h3 style="text-align: center;" >Репетитор</h3>' +
            '' +
            'Это идеальный вариант для тех, кто еще не успел убедиться в преимуществах нашей платформы.  ' +
            'Вы можете <b>совершенно бесплатно пользоваться всеми материалами и созданными нами тренажерами</b> ' +
            'для обучения максимум <b>5</b> человек.  ' +
            'Вы сможете, однако, создавать собственные курсы, опираясь на наши материалы.' +
            '' +
            '<br/><br/>' +
            '' +
            'Если же Вы – творческий человек, и Вам захочется создавать собственные тренажеры, ' +
            'используя свои материалы, то Вам нужен тариф «коллективный».  ' +
            'Ведь коллектив Ваших учеников в этом случае наверняка увеличится.' +
            '',
            examples: []
        },
        'group': {
            name: 'Коллективный',
            price: 1499,
            options: [
                {
                    text: 'от <b>6</b> до <b>20</b> учеников'
                },
                {
                    text: 'изготовление тренажеров '
                }
            ],
            description: '' +
            '<h3 style="text-align: center;" >Коллективный</h3>' +
            '<br/>' +
            '' +
            'Заплатив символическую сумму, вы сможете обучать до <b>20</b> учеников, ' +
            'имея возможности создавать собственные тренажеры и основанные на них курсы, ' +
            'делясь ими с другими преподавателями.' +
            '',
            examples: []
        },

        'professional': {
            name: 'Профессиональный',
            price: 4999,
            options: [
                {
                    text: 'от <b>21</b> до <b>100</b> учеников<sup style="color: #F7814D;" >*</sup>'
                },
                {
                    text: 'изготовление тренажеров '
                },
                {
                    text: 'продажа ваших курсов'
                }
            ],
            description: '' +
            '<h3 style="text-align: center;" >Профессиональный</h3>' +
            '' +
            'Тариф предусматривает возможность обучения до <b>100</b> учеников, ' +
            'при этом Вы сможете <b>не только создавать свои тренажеры, ' +
            'но и делать их доступными для других преподавателей</b>. ' +
            'Создав уникальную коллекцию материалов, задействованных в авторских тренажерах, ' +
            'Вы сможете <b>продать свои курсы</b> другим пользователям платформы. ' +
            'Комиссия платформы в этом случае составит всего <b>3%</b>. ' +
            '<br/> <br/> ' +
            'Если у Вас более 100 учеников, то рекомендуем <a target="_blank" href="mailto:lirmakym@mail.ru">обратиться к нам напрямую</a> и обсудить ' +
            'детали сотрудничества.' +
            '',
            examples: []
        },

        'enterprise': {
            name: 'Корпоративный',
            price: 'XXXX',
            options: [
                {
                    text: 'профессиональная коммуникация'
                },
                {
                    text: 'изготовление тренажеров'
                },
                {
                    text: 'тесты и олимпиады'
                },
                {
                    text: 'выезд к заказчику и обучение персонала'
                }
            ],
            description: '' +
            '<h3 style="text-align: center;" >Корпоративный</h3>' +
            '' +
            'Если вы заинтересовались нашей платформой, ' +
            'то просим вас <a target="_blank" href="mailto:lirmakym@mail.ru">связаться с нами</a>. ' +
            '<br/><br/>' +
            'Каждый корпоративный заказчик ' +
            '<b>уникален своей тематикой, от которой зависят ' +
            'затраты на создание специализированных курсов. </b>' +
            '<br/><br/>' +
            'Пример: тематика для предприятия нефтегазовой отрасли.' +
            '<br/>' +
            '<br/>' +
            ' <div style="text-align: center;" >' +
            '  <iframe style="border: none;" width="750" height="500" src="https://player.vimeo.com/video/137111231?title=0&byline=0&portrait=0"></iframe>' +
            ' </div>' +
            '',
            examples: [
                {
                    content: '' +
                    '<div  >' +
                    'Мы можем также изготовить на заказ' +
                    ' <a href="https://www.englishpatient.org/app/#/class/x3WkI72Ou3" target="_blank" >тесты</a> и <a href="https://www.englishpatient.org/app/#/class/Z2QlAMpwX5" target="_blank" >олимпиады</a>.' +
                    '<br/> <br/>' +
                    '' +
                    '' +
                    '' +
                    '</div>' +
                    '' +
                    '',
                    feedsList: [] //todo: add pilots feed ids
                },
                {
                    content: 'Современные университеты озабочены способностью своих сотрудников ' +
                    'преподавать на английском языке профильные предметы. ' +
                    'Для них на нашей платформе создаются такие тренажеры' +
                    '<br/>',
                    feedsList: ['eoa1HoVoWx', 'i5OqxtVh9n', 'NqM52sGD9B', 'm7h4OACgGn', 'WIjCXcdV1D'],  //todo: add Физика     математика  программирование экономика
                },
                {
                    content: 'Если заказчик обладает собственной образовательной структурой, ' +
                    'мы организуем обучение ее сотрудников. По окончании обучения, ' +
                    'они смогут, например, создавать тренажеры такого типа:',
                    feedsList: ['CcNkrMlMpv'] //todo: add ВУСАЛОВА ХИМИЯ
                }
            ]
        }


    }


}

module.exports = DataFactory;